Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This call to obtain the user principal will return null if the caller is unauthenticated, non-null if the caller is authenticated.
ja_jp: ユーザープリンシパルを取得するためのこの呼び出しは、呼び出し元が認証されていない場合はnullを返し、呼び出し元が認証されている場合は非nullを返します。

source: This callback is invoked before the bean instance is destroyed. It is safe to perform some cleanup tasks here.
ja_jp: このコールバックは、Beanインスタンスが破棄される前に呼び出されます。ここでいくつかのクリーンアップタスクを実行しても安全です。

source: This callback is invoked before the bean instance is put into service. It is safe to perform some initialization here.
ja_jp: このコールバックは、Beanインスタンスがサービスに投入される前に呼び出されます。ここでいくつかの初期化を行うのが安全です。

source: This can also be written with indexed property syntax:
ja_jp: これは、インデックス付プロパティ構文で書くこともできます:

source: This can be achieved by adding another build step:
ja_jp: これは、別のビルドステップを追加することで実現できます。

source: This can be achieved by adding the following lines to the `application.properties`:
ja_jp: これは、以下の行を `application.properties` に追加することで実現できます：

source: This can be achieved by requesting a token refresh by using a refresh token. However, if the refresh token is unavailable, you can refresh it by revoking it first and then requesting a new access token.
ja_jp: リフレッシュトークンを使用してトークンのリフレッシュを要求することができます。リフレッシュトークンが利用できない場合は、まずそれを失効させてから、新しいアクセストークンをリクエストすることで更新できます。

source: This can be achieved by requesting a token refresh using a refresh token. However, if the refresh token is not available then you can refresh it by revoking it first and then request a new access token.
ja_jp: リフレッシュトークンを使用してトークンのリフレッシュを要求することができます。リフレッシュトークンが利用できない場合は、まずそれを失効させてから、新しいアクセストークンをリクエストすることでリフレッシュできます。

source: This can be achieved by setting to DEBUG the following log category inside your `application.properties`:
ja_jp: これは、 `application.properties` の中で以下のログカテゴリーを DEBUG に設定することで実現できます。

source: This can be attributed to a number of different reasons:
ja_jp: これには様々な理由があります。

source: This can be done automatically by adding protostream annotations to your user classes. In addition, a single Initializer annotated interface is required which controls how the supporting classes are generated.
ja_jp: これは、ユーザクラスに protostream アノテーションを追加することで自動的に行えます。加えて、初期化子がアノテーションされたインターフェースが1つ必要です。これは、サポートするクラスの生成方法を制御します。

source: This can be done by adding another xref:building-my-first-extension.adoc#deploying-the-greeting-feature[build step] to declare the action in your extension's xref:building-my-first-extension.adoc#description-of-a-quarkus-extension[`deployment`] module:
ja_jp: これは、別の link:building-my-first-extension.html#deploying-the-greeting-feature[ビルドステップ]を追加して、アクションをエクステンションの link:building-my-first-extension.html#description-of-a-quarkus-extension[`deployment`]モジュールでアクションを宣言することで実現可能です。

source: This can be done using the `addLibraryVersion` method:
ja_jp: これは `addLibraryVersion` メソッドを使用して実行できます。

source: This can be enabled using the following command:
ja_jp: これは以下のコマンドで有効にできます：

source: This can be transitively or directly and is only needed in deployment module. This gives your processor access to the relative Build Items.
ja_jp: これは推移的または直接的に含めることができ、デプロイメントモジュールでのみ必要です。これにより、プロセッサーは関連するビルドアイテムにアクセスできます。

source: This can be used alongside Quarkus build profiles to enable/disable channels based on some build-time condition, such as the the target environment. You need to make sure of two things when disabling a channel:
ja_jp: これを Quarkus ビルドプロファイルと一緒に使用して、ターゲット環境などのビルド時の条件に基づいてチャネルを有効化/無効化することができます。 チャネルを無効化するときは、以下の 2 つの点を確認する必要があります。

source: This can be useful to trace incoming requests from non-REST calls (like request coming from a message) or to create spans inside a trace.
ja_jp: これは、非RESTコール(メッセージからのリクエストなど)からの着信リクエストをトレースしたり、トレース内にスパンを作成したりするのに便利です。

source: This can be worked around by applying some modifications to the perf output, in order to make all threads have the same name. E.g.
ja_jp: これは、すべてのスレッドが同じ名前になるように、perfの出力にいくつかの変更を加えることで回避できます。例えば、以下のようになります。

source: This can cause values in Java programs that would normally vary from one run to another, to always return a constant value. E.g. a static field that is assigned the value of `System.currentTimeMillis()` will always return the same value when executed as a Quarkus native executable.
ja_jp: これにより、通常は実行ごとに異なるJavaプログラムの値が、常に一定の値として返されるようになります。例えば、 `System.currentTimeMillis()` という値が割り当てられている静的フィールドは、Quarkus ネイティブ実行ファイルとして実行されると、常に同じ値を返します。

source: This can load all application classes, its parent is the Augment ClassLoader so it can also load all deployment classes.
ja_jp: これはすべてのアプリケーションクラスをロードすることができ、その親は 拡張 ClassLoader なので、すべてのデプロイメントクラスをロードすることもできます。

source: This can load all application classes. Its parent is the Augment ClassLoader, so it can also load all deployment classes.
ja_jp: これはすべてのアプリケーションクラスをロードすることができます。その親は 拡張 ClassLoader なので、すべてのデプロイメントクラスをロードすることもできます。

source: This can load all application classes. Its parent is the Augmentation ClassLoader, so it can also load all deployment classes.
ja_jp: これはすべてのアプリケーション・クラスをロードできます。その親はオーグメンテーションクラスローダーなので、すべてのデプロイメントクラスをロードすることもできます。

source: This can throw all kinds of remote exceptions
ja_jp: これは、あらゆる種類のリモート例外を投げることができます

source: This cannot be avoided like in the xref:hibernate-search-orm-elasticsearch.adoc[Hibernate Search extension with Hibernate ORM] with xref:hibernate-search-orm-elasticsearch.adoc#coordination[coordination through outbox polling], because that coordination requires Hibernate ORM and relies on the fact that data is derived from that of a (transactional) relational database.
ja_jp: これは、xref:hibernate-search-orm-elasticsearch.adoc#coordination[送信トレイポーリングによる調整] により、 xref:hibernate-search-orm-elasticsearch.adoc[Hibernate ORM を使用した Hibernate Search エクステンション] のように回避することはできません。 なぜなら、その調整には Hibernate ORM が必要であり、 そのデータが (トランザクション) リレーショナルデータベースのデータから取得されるという事実に依存しているからです。

source: This causes a cookie to be set for the challenge, it will be used by the login step later.
ja_jp: これにより、チャレンジ用の Cookie が設定され、後でログイン手順で使用されます。

source: This causes a cookie to be set for the challenge, it will be used by the registration step later.
ja_jp: これにより、チャレンジ用の Cookie が設定され、後で登録手順で使用されます。

source: This change required some fairly extensive refactoring of the JAR assembly code, but it was definitely worth it.
ja_jp: この変更には、JARアセンブリコードのかなりの大規模なリファクタリングが必要でしたが、それだけの価値は十分にありました。

source: This change will have consequences on your workflow as the produced artifacts are now under a `quarkus-app` directory.
ja_jp: この変更は、生成された成果物が `quarkus-app` ディレクトリの下に置かれるようになったため、ワークフローに影響を及ぼします。

source: This channel is mapped to a RabbitMQ exchange using the configuration we will add to the `application.properties` file. Open the `src/main/resource/application.properties` file and add:
ja_jp: このチャンネルは、 `application.properties` ファイルの設定を使用して、RabbitMQ のエクスチェンジにマッピングされます。 `src/main/resource/application.properties` ファイルを開き、次のように追加します:

source: This chapter describes SBOMs that manifest outcomes of Quarkus builds that are final application distributions.
ja_jp: この章では、最終的なアプリケーションディストリビューションである Quarkus ビルドの出力を明示する SBOM について説明します。

source: This chapter describes how to generate SBOMs manifesting only the dependencies of an application before it is built. In other words, these SBOMs will manifest the input into a build. These SBOMs could be used to perform vulnerability and compliance related analysis before building applications.
ja_jp: この章では、ビルド前にアプリケーションの依存関係のみを明示する SBOM の生成ｂｂｂｂｂｂ方法について説明します。つまり、これらの SBOM は、ビルドへの入力を明示しており、アプリケーションのビルド前に脆弱性およびコンプライアンス関連の分析を実行するために使用できます。

source: This chapter is relevant for https://quarkus.io/guides/platform[Quarkus platform] developers who want to provide codestart data in the https://quarkus.io/guides/platform#platform-descriptor[platform metadata].
ja_jp: この章は、 link:https://quarkus.io/guides/platform[Quarkusプラットフォーム] の開発者が、 link:https://quarkus.io/guides/platform#platform-descriptor[プラットフォームのメタデータ] でコードスタートデータを提供する場合に関連します。

source: This class is a _converter_. It maps the content of a `Message` to another type. In the `canConvert` method, we verify that the incoming message is coming from AMQP (so contain the `IncomingAmqpMetadata` metadata) and that the content-type is set to `application/json`. The `convert` method maps the received `JsonObject` into the target type (`Movie` in our case).
ja_jp: このクラスは _converter_ です。 `Message` の内容を別の型にマッピングします。 `canConvert` メソッドでは、受信メッセージが AMQP からのものであること (つまり `IncomingAmqpMetadata` メタデータを含むこと) と、content-type が `application/json` に設定されていることを確認します。 `convert` メソッドは、受信した `JsonObject` をターゲット型 (私たちの場合は `Movie` ) にマッピングします。

source: This class models the HTTP interaction with the weather service. Read more about the rest client in the dedicated xref:./rest-client.adoc[guide].
ja_jp: このクラスは気象サービスとの HTTP インタラクションをモデル化します。 RESTクライアントについて詳しくは、専用の xref:./rest-client.adoc[ガイド] を参照してください。

source: This class now uses the `@Traced` annotation and creates a "manual" programmatic span.
ja_jp: このクラスは `@Traced` アノテーションを使用し、「手動」のプログラムスパンを作成します。

source: This class represents `Fruits`. It's a straightforward entity with a single field (`name`). Note that it uses `io.quarkus.hibernate.reactive.panache.PanacheEntity`, the reactive variant of `PanacheEntity`. So, behind the scenes, Hibernate uses the execution model we described above. It interacts with the database without blocking the thread. In addition, this reactive `PanacheEntity` proposes a reactive API. We will use this API to implement the REST endpoint.
ja_jp: このクラスは `Fruits` を表します。1つのフィールド( `name`)を持つ単純なエンティティです。なお、このクラスは `PanacheEntity` のリアクティブ版である `io.quarkus.hibernate.reactive.panache.PanacheEntity` を使用しています。つまり、舞台裏では、Hibernate は上述の実行モデルを使用しています。スレッドをブロックすることなく、データベースと対話します。さらに、このリアクティブな `PanacheEntity` は、リアクティブな API を提案しています。このAPIを使用してRESTエンドポイントを実装します。

source: This class uses the `MovieProducer` we implemented above to send the `movies`. You could also use an `Emitter` directly.
ja_jp: このクラスは、上で実装した `MovieProducer` を使用して `movies` を送信します。 `Emitter` を直接使用することもできます。

source: This clear definition of the computation boundaries allows Drools to also automatically generate a class executing the query and returning its results, together with a REST endpoint taking the rule unit as input, passing it to the former query executor and returning its as output.
ja_jp: この計算境界の明確な定義により、Drools はクエリーを実行してその結果を返すクラスを自動的に生成し、ルールユニットを入力として受け取り、それを以前のクエリー実行者に渡して出力として返す REST エンドポイントも生成できます。

source: This code configures the SockJS bridge to send all the messages targeting the `ticks` address to the connected browsers. More detailed explanations about the configuration can be found on https://vertx.io/docs/vertx-web/java/#_sockjs_event_bus_bridge[the Vert.x SockJS Bridge documentation].
ja_jp: このコードは、 `ticks` アドレスをターゲットとするすべてのメッセージを接続されたブラウザに送信するように SockJS ブリッジを設定します。 設定に関するより詳細な説明は、 https://vertx.io/docs/vertx-web/java/#_sockjs_event_bus_bridge[Vert.x SockJS Bridge ドキュメント] に記載されています。

source: This code configures the SockJS bridge to send all the messages targeting the `ticks` address to the connected browsers. More detailled explanations about the configuration can be found on https://vertx.io/docs/vertx-web/java/#_sockjs_event_bus_bridge[the Vert.x SockJS Bridge documentation].
ja_jp: このコードは、SockJSブリッジが接続されたブラウザに `ticks` のアドレスをターゲットとしたすべてのメッセージを送信するように設定します。設定についての詳細な説明は、 link:https://vertx.io/docs/vertx-web/java/#_sockjs_event_bus_bridge[Vert.x SockJS Bridge のドキュメント]にあります。

source: This code is responsible for making data available to display on the UI.
ja_jp: このコードは、データを UI に表示できるようにする役割を担います。

source: This code reads a file, and as it's an asynchronous operation, invokes the callback when the file is read. The `readFile` method reads the complete content of the file and accumulates it in a _buffer_. The callback receives the asynchronous result containing either the file's content (`ar.result()`) or a failure. Vert.x invokes this callback when the operation has either completed or failed.
ja_jp: このコードはファイルを読み込み、非同期操作であるため、ファイルが読み込まれたときにコールバックを呼び出します。 `readFile` メソッドは、ファイルの完全な内容を読み込み、 _バッファ_ に蓄積します。コールバックは、ファイルの内容 ( `ar.result()` ) または失敗を含む非同期の結果を受け取ります。Vert.x は、操作が完了または失敗したときにこのコールバックを呼び出します。

source: This code uses the `io.smallrye.common.vertx.VertxContext` helper class.
ja_jp: このコードでは、 `io.smallrye.common.vertx.VertxContext` ヘルパークラスを使用しています。

source: This code will now work both for the authorization code and bearer access token flows.
ja_jp: このコードは、認可コードフローとベアラーアクセストークンフローの両方で機能するようになります。

source: This code will try to copy 256 bytes from address `0x0` to `0x80` resulting in a Segmentation Fault. To verify this compile and run the example application:
ja_jp: このコードは、アドレス `0x0` から `0x80` へ 256 バイトをコピーしようとするため、セグメンテーション・フォールトが発生します。これを確認するには、サンプルアプリケーションをコンパイルして実行します。

source: This code will try to copy 256 bytes from address `0x0` to `0x80` resulting in a Segmentation Fault. To verify this, compile and run the example application:
ja_jp: このコードは、アドレス `0x0` から `0x80` へ 256 バイトをコピーしようとするため、セグメンテーションフォールトが発生します。これを確認するには、サンプルアプリケーションをコンパイルして実行します。

source: This code won't work anymore since `RemoteCache` is now an `@ApplicationScoped` proxy bean. `Search.getQueryFactory` will raise a ClassCastException. Remove the unecessary indirection by using the `query` method in the `RemoteCache` API as follows.
ja_jp: `RemoteCache` は現在 `@ApplicationScoped` プロキシ Bean なので、このコードはもう動作しません。 `Search.getQueryFactory` は ClassCastException を発生させます。 `RemoteCache` API の `query` メソッドを以下のように使用して、不要な間接処理を削除します。

source: This command adds the following dependencies to your build file:
ja_jp: このコマンドは、ビルドファイルに以下の依存関係を追加します。

source: This command adds the following dependency to your build file:
ja_jp: このコマンドは、ビルドファイルに以下の依存関係を追加します:

source: This command creates the project structure and select the two Quarkus extensions we will be using:
ja_jp: このコマンドは、プロジェクト構造を作成し、使用する2つのQuarkusエクステンションを選択します:

source: This command creates the project structure and selects the two Quarkus extensions we will be using:
ja_jp: このコマンドは、プロジェクト構造を作成し、使用する 2 つの Quarkus エクステンションを選択します。

source: This command creates the project structure and selects two Quarkus extensions we will be using:
ja_jp: このコマンドは、プロジェクト構造を作成し、使用する 2 つの Quarkus エクステンションを選択します。

source: This command generates a .java file that you can directly run on Linux and macOS, i.e. `./quarkusapp.java` - on Windows you need to use `jbang quarkusapp.java`.
ja_jp: このコマンドは、Linux と macOS で直接実行できる .java ファイルとして `./quarkusapp.java` を生成します。Windows では、 `jbang quarkusapp.java` を使用する必要があります。

source: This command generates a Maven project and imports the `spring-data-jpa` extension.
ja_jp: このコマンドは、Maven プロジェクトを生成し、 `spring-data-jpa` エクステンションをインポートします。

source: This command generates a Maven project with a REST endpoint and adds the `spring-scheduled` extension.
ja_jp: このコマンドは、RESTエンドポイントを持つMavenプロジェクトを生成し、 `spring-scheduled` エクステンションを追加します。

source: This command generates a Maven project with a REST endpoint and imports the `resteasy-client` and `resteasy` extensions. It also adds the `resteasy-multipart` extension to support `multipart/form-data` requests.
ja_jp: このコマンドは REST エンドポイントを持つ Maven プロジェクトを生成し、 `resteasy-client` と `resteasy` エクステンションをインポートします。 また、 `multipart/form-data` リクエストをサポートするために `resteasy-multipart` エクステンションも追加します。

source: This command generates a Maven project with a REST endpoint and imports the `spring-data-jpa` extension.
ja_jp: このコマンドは、REST エンドポイントを持つ Maven プロジェクトを生成し、 `spring-data-jpa` エクステンションをインポートします。

source: This command generates a Maven project with the `spring-scheduled` extension.
ja_jp: このコマンドは、Maven プロジェクトを生成し、 `spring-scheduled` エクステンションをインポートします。

source: This command generates a Maven project, importing the Reactive Messaging and Kafka connector extensions.
ja_jp: このコマンドは、Reactive Messaging と Kafka connector エクステンションをインポートして Maven プロジェクトを生成します。

source: This command generates a Maven project, importing the `keycloak` extension which is an implementation of a Keycloak Adapter for Quarkus applications and provides all the necessary capabilities to integrate with a Keycloak Server and perform bearer token authorization.
ja_jp: このコマンドは、Quarkusアプリケーション用のKeycloakアダプターの実装であり、Keycloakサーバーと統合してベアラートークン認証を実行するために必要なすべての機能を提供する `keycloak` エクステンションをインポートして、Mavenプロジェクトを生成します。

source: This command generates a Maven project, importing the `kogito-quarkus-decisions` extension that comes with all needed dependencies and configuration to equip your application with business automation. It also imports the `resteasy-jackson` extension that is needed for Kogito to expose REST services.
ja_jp: このコマンドは Maven プロジェクトを生成し、アプリケーションにビジネス自動化を装備するために必要なすべての依存関係と設定が付属している `kogito-quarkus-decisions` エクステンションをインポートします。また、Kogito が REST サービスを公開するために必要な `resteasy-jackson` エクステンションもインポートします。

source: This command generates a Maven project, importing the `kogito-quarkus-decisions` extension that comes with all needed dependencies and configuration to equip your application with business automation. It also imports the `resteasy-reactive-jackson` extension that is needed for Kogito to expose REST services.
ja_jp: このコマンドはMavenプロジェクトを生成し、アプリケーションにビジネス・オートメーションの機能を追加するために必要な依存関係と構成をすべて備えた `kogito-quarkus-decisions` エクステンションをインポートします。また、KogitoがRESTサービスを公開するのに必要な `resteasy-jackson` エクステンションをインポートします。

source: This command generates a Maven project, importing the `kogito-quarkus-rules` extension that comes with all needed dependencies and configuration to equip your application with business automation. It also imports the `resteasy-jackson` extension that is needed for Kogito to expose REST services.
ja_jp: このコマンドは Maven プロジェクトを生成し、アプリケーションにビジネス自動化を装備するために必要なすべての依存関係と構成が付属している `kogito-quarkus-rules` エクステンションをインポートします。また、Kogito が REST サービスを公開するために必要な `resteasy-jackson` エクステンションもインポートします。

source: This command generates a Maven project, importing the `kogito-quarkus-rules` extension that comes with all needed dependencies and configuration to equip your application with business automation. It also imports the `resteasy-reactive-jackson` extension that is needed for Kogito to expose REST services.
ja_jp: このコマンドはMavenプロジェクトを生成し、アプリケーションにビジネス・オートメーションの機能を追加するために必要な依存関係と構成をすべて備えた `kogito-quarkus-rules` エクステンションをインポートします。また、KogitoがRESTサービスを公開するのに必要な `resteasy-jackson` エクステンションをインポートします。

source: This command generates a Maven project, importing the `kogito` extension that comes with all needed dependencies and configuration to equip your application with business automation. It also imports the `resteasy-jackson` extension that is needed for Kogito to expose REST services.
ja_jp: このコマンドは Maven プロジェクトを生成し、アプリケーションにビジネス自動化を装備するために必要なすべての依存関係と構成が付属している `kogito` エクステンションをインポートします。また、Kogito が REST サービスを公開するために必要な `resteasy-jackson` エクステンションもインポートします。

source: This command generates a Maven project, importing the `kogito` extension that comes with all needed dependencies and configuration to equip your application with business automation. It also imports the `resteasy-reactive-jackson` extension that is needed for Kogito to expose REST services.
ja_jp: このコマンドはMavenプロジェクトを生成し、アプリケーションにビジネス・オートメーションを装備するために必要な依存関係と設定をすべて備えた `kogito` エクステンションをインポートします。また、KogitoがRESTサービスを公開するのに必要な `resteasy-reactive-jackson` エクステンションをインポートします。

source: This command generates a Maven project, importing the `oidc` extension which is an implementation of OIDC for Quarkus.
ja_jp: このコマンドは、QuarkusのOIDCの実装である `oidc` エクステンションをインポートして、Mavenプロジェクトを生成します。

source: This command generates a Maven project, importing the `oidc`, `oidc-client-reactive-filter`, `oidc-client-reactive-filter` and `resteasy-reactive` extensions.
ja_jp: このコマンドは、 `oidc`、 `oidc-client-reactive-filter`、 `oidc-client-reactive-filter`、 `resteasy-reactive` エクステンションをインポートして Maven プロジェクトを生成します。

source: This command generates a Maven project, importing the `oidc`, `oidc-client-reactive-filter`, `oidc-token-propagation-reactive-filter` and `resteasy-reactive` extensions.
ja_jp: このコマンドは、 `oidc`、 `oidc-client-reactive-filter`、 `oidc-token-propagation-reactive-filter` 、 `resteasy-reactive` エクステンションをインポートして Maven プロジェクトを生成します。

source: This command generates a Maven project, importing the `security-jpa` extension which allows you to map your security source to JPA entities.
ja_jp: このコマンドは、セキュリティー ソースを JPA エンティティーにマップできる `security-jpa` エクステンションをインポートして、Maven プロジェクトを生成します。

source: This command generates a Maven project, importing the `security-webauthn` extension which allows you to use WebAuthn to authenticate users.
ja_jp: このコマンドは Maven プロジェクトを生成し、WebAuthn を使ってユーザー認証を行うための `security-webauthn` エクステンションをインポートします。

source: This command generates a Maven project, that imports the `micrometer-registry-prometheus` extension as a dependency. This extension will load the core `micrometer` extension as well as additional library dependencies required to support prometheus.
ja_jp: このコマンドは、 `micrometer-registry-prometheus` エクステンションを依存関係としてインポートする Maven プロジェクトを生成します。このエクステンションは、 `micrometer` エクステンションだけでなく、 Prometheus をサポートするために必要な追加のライブラリ依存関係もロードします。

source: This command generates a Maven structure importing the Quarkus REST (formerly RESTEasy Reactive) Jackson and MongoDB Client extensions. After this, the `quarkus-mongodb-client` extension has been added to your build file.
ja_jp: このコマンドは、Quarkus REST (旧称 RESTEasy Reactive) Jackson および MongoDB クライアントエクステンションをインポートする Maven 構造を生成します。 その後、 `quarkus-mongodb-client` エクステンションがビルドファイルに追加されます。

source: This command generates a Maven structure importing the Quarkus REST (formerly RESTEasy Reactive) Jackson and MongoDB with Panache extensions. After this, the `quarkus-mongodb-panache` extension has been added to your build file.
ja_jp: このコマンドは、Quarkus REST (旧称 RESTEasy Reactive) Jackson と MongoDB with Panache エクステンションをインポートする Maven 構造を生成します。 これで、 `quarkus-mongodb-panache` エクステンションがビルドファイルに追加されました。

source: This command generates a Maven structure importing the Quarkus REST (formerly RESTEasy Reactive), Jackson, and Elasticsearch low level REST client extensions.
ja_jp: このコマンドは、Quarkus REST（旧RESTEasy Reactive）、Jackson、Elasticsearchの低レベルRESTクライアントエクステンションをインポートするMaven構造を生成します。

source: This command generates a Maven structure importing the Quarkus REST (formerly RESTEasy Reactive)/Jakarta REST, Jackson and Hibernate Validator/Bean Validation extensions.
ja_jp: このコマンドは、Quarkus REST (旧RESTEasy Reactive)/Jakarta REST、Jackson、およびHibernate Validator/Bean ValidationエクステンションをインポートするMaven構造を生成します。

source: This command generates a Maven structure importing the RESTEasy Reactive Jackson and MongoDB Client extensions. After this, the `quarkus-mongodb-client` extension has been added to your build file.
ja_jp: このコマンドは、RESTEasy Reactive JacksonとMongoDB ClientエクステンションをインポートするMaven構造を生成します。その後、 `quarkus-mongodb-client` エクステンションがビルドファイルに追加されます。

source: This command generates a Maven structure importing the RESTEasy Reactive Jackson and MongoDB with Panache extensions. After this, the `quarkus-mongodb-panache` extension has been added to your build file.
ja_jp: このコマンドは、RESTEasy Reactive JacksonとMongoDB with PanacheエクステンションをインポートするMaven構造を生成します。この後、 `quarkus-mongodb-panache` エクステンションがビルドファイルに追加されています。

source: This command generates a Maven structure importing the RESTEasy Reactive, Jackson, and Elasticsearch low level REST client extensions.
ja_jp: このコマンドは、RESTEasy Reactive、Jackson、およびElasticsearch低レベルRESTクライアントエクステンションをインポートするMaven構造を生成します。

source: This command generates a Maven structure importing the RESTEasy Reactive/JAX-RS, Jackson and Hibernate Validator/Bean Validation extensions.
ja_jp: このコマンドは、RESTEasy/JAX-RS、Jackson、およびHibernate Validator/Bean ValidationエクステンションをインポートするMavenディレクトリー構造を生成します。
